{
    "Changes": [
        {
            "Action": "EditData",
            "Target": "Data/Characters",
            "Entries": {
                "{{ModId}}_KimLuya": {
                    //기Basic info
                    "DisplayName": "김루야",
                    "Gender": "Female", //self-explanatory: can be male, female, or undefined (for nonbinary)
                    "Age": "teen", //can be child, teen or adult; affects certain default strings
                    "Manner": "rude", //can be polite, neutral, or rude; affects certain default strings
                    "SocialAnxiety": "shy", //can be outgoing, neutral, or shy; affects certain default strings
                    "Optimism": "Positive", //can be positive, neutral, or negative; affects certain default strings
                    "BirthSeason": "spring", //self-explanatory
                    "BirthDay": "14", //self-explanatory
                    "HomeRegion": "Beach", //can be Town, Desert, or Other - I suggest Town so they're included in certain activities like the Luau friendship boost and Winter Star, unless you're doing a hidden or non-human NPC, in which case you might want Other. 

                    //Social features
                    "CanBeRomanced": false, //Whether or not the NPC is dateable/marryable. 
                    "CanVisitIsland": false, //Whether the NPC can visit the resort. Set to false if you don't want them at the beach or don't have your resort strings set up.
                    "SpouseAdopts": false, //Gdragon
                    "CanReceiveGifts":false, // TODO: gifttastes afterworks on it

                    //외부노출세팅
                    "IntroductionsQuest": false, //If you don't want your NPC to be included as part of the introductions quest (perhaps if you have an NPC you want hidden at the start), set to false
                    "ItemDeliveryQuests": false, //set to false if you want to not have them included in the Help Wanted regular quests for fetching items for reasons, e.g., if they are a cat.
                    "WinterStarParticipant": false, //set to false if you don't want your NPC to be part of the random gifter/giftee pool.
                    "SocialTab": "HiddenUntilMet",
                    "Calendar":"HiddenUntilMet",
                    "PerfectionScore":false,
                    "Home": [ //set this to where you want the NPC to spawn in normally.  
                        {
                            "Id": "Default",
                            "Location": "BasakToasts.LuyaSubmarine",
                            "Tile": {
                                "X": 5,
                                "Y": 8
                            },
                            "Direction": "left"
                        }
                    ],
                    //Appearance & sprite
                    //"TextureName"://달력과 소셜탭에서 노출되는 형태.(해당스프라이트를 기준으로 현재모습이 출력됌)
                },
            }
        }
    ]
}